Dlubal.RFEM5.GuidelineType
Type of guideline

Dlubal.RFEM5.GuidelineType.UnknownGuidelineType
Unknown type

Dlubal.RFEM5.GuidelineType.ParallelToX
Parallel to X

Dlubal.RFEM5.GuidelineType.ParallelToY
Parallel to Y

Dlubal.RFEM5.GuidelineType.ParallelToZ
Parallel to Z

Dlubal.RFEM5.GuidelineType.BiasBy2Points
Bias by 2 points

Dlubal.RFEM5.GuidelineType.BiasAngleAndPoint
Bias by angle and point

Dlubal.RFEM5.GuidelineType.PolarGuideline
Polar